const express = require('express');
const app = express();

// Словарь номеров и названий регионов
const regions = {
  '01': 'Республика Адыгея',
  '02': 'Республика Башкортостан',
  '03': 'Республика Бурятия',
  '04': 'Республика Алтай',
  '05': 'Республика Дагестан',
  '06': 'Республика Ингушетия',
  '07': 'Кабардино-Балкарская Республика',
  '08': 'Республика Калмыкия',
  '09': 'Карачаево-Черкесская Республика',
  '10': 'Республика Карелия',
  '11': 'Республика Коми',
  '12': 'Республика Марий Эл',
  '13': 'Республика Мордовия',
  '14': 'Республика Саха (Якутия)',
  '15': 'Республика Северная Осетия - Алания',
  '16': 'Республика Татарстан',
  '17': 'Республика Тыва',
  '18': 'Удмуртская Республика',
  '19': 'Республика Хакасия',
  '20': 'Чувашская Республика',
  '21': 'Алтайский край',
  '22': 'Краснодарский край',
  '23': 'Красноярский край',
  '24': 'Приморский край',
  '25': 'Ставропольский край',
  '26': 'Хабаровский край',
  '27': 'Амурская область',
  '28': 'Архангельская область',
  '29': 'Астраханская область',
  '30': 'Белгородская область',
  '31': 'Брянская область',
  '32': 'Владимирская область',
  '72': 'Тюменская область'

};

// Обработчик GET-запроса для получения названия региона
app.get('/:regionNumber', (req, res) => {
  const regionNumber = req.params.regionNumber;
  const regionName = regions[regionNumber];

  if (regionName) {
    res.json({ region: regionName });
  } else {
    res.status(404).json({ error: 'Region not found' });
  }
});

// Запуск сервера на порту 3000
app.listen(3000, () => {
  console.log('Сервер запущен на порту 3000');
});
